{
  "encrypted": "<p>Hello smart individual, it seems that you are looking for the content. However, we have thought about this and hidden it away. We appreciate that you have come here and sorry for wasting your time. Here is the link to our content: <a href=\"bit.ly/3IJOhjV\">Real Essay with Reading Voice Over</a></p>",
  "unencrypted": "Dolores sic tas",
  "tos": "<h2>Last updated: December 8th, 2021</h2><h2>Terms of Service</h2><p>PLEASE READ THESE TERMS CAREFULLY. These Terms of Service govern your use of this application. By agreeing to the terms, you are granted access to the website and are abided by all the terms listed in this Terms of Service. If you do NOT agree with any of these terms, simply exit the page by dialing away from it. We would recommend Youtube.</p><h2>Definition</h2><p>'We', 'Us', and 'Our' are the three entities who hold the copyright to this application. 'You' and 'Your' are the entity who is reading and accepting this Terms of Service.</p><h2>Binding agreement</h2><p>The content on this page is copyrighted by Group 10 of INFO 350 Autumn 2022 Class of the University of Washington and therefore, is copyrighted by the three entities Toan Ly, Luke Dorsett, and Ryan Mudgett. Any usage of any part of this application outside of the Internet and our domain is considered illegal and might result in violence. Internet is defined as if you have access to google.com. Violence here is defined by the act of punching and/or kicking from one entity to another. In this case, we will give you the violence and you have the right to give us the violence back if you deem it to be necessary. If you would like to quote part of our content, you may do so and link it back to our application. You must NOT transmitted any worms, viruses, or destructive codes of any kind to this application. This application is hosted by Github for the front end and Heroku on the back end. Therefore, by agreeing to these terms, you are also agreeing to their Terms of Service. Their Terms of Service can be found on their respective websites. The website was created with open sourced projects. React JS by Facebook for the front end developement and Express JS for back end REST API development. The source code for this website is opened but, we will not tell you where it is. If you have read this far, it is probably the case that you are stuck with the 15 minute timer that we have set on the website or maybe, you actually read everything up to this point of these Terms of Service (kudos to you for doing that). You can <span id=\"click-here\">click here</span> to close it. These words below are meant to hide the click here button away. The ingredients for cheesecake are block cream cheese, sugar, sour cream, pure vanilla, lemon juice, and eggs. Did you know that on a sunny day, the sun is out? Why are you still reading this? Disclaimer: WE ARE NOT LAWYERS and every part of this Terms of Service should not be taken seriously. We reserve the right to refuse your access to our website.</p><h2>Privacy Policies</h2><p>We do not collect cookies or use any form of tracking. If you feel like you are being tracked on our website, it is not us but, probably Github or Heroku. Blame them. We have nothing to do with it.</p><h2>Termination of usage</h2><p>We reserve the right to block your IP address from accessing our application if necessary. Even if you are using a VPN, we will hunt you down and block your corresponding VPN's IP addresses.</p>"
}
