{
  "encrypted": "<p>Hello smart individual, it seems that you are looking for the content. However, we have thought about this and hidden it away. We appreciate that you have come here and sorry for wasting your time. Here is the link to our content: <a href=\"http://bit.ly/3IJOhjV\">Real Essay with Reading Voice Over</a></p>",
  "unencrypted": "<h2>Introduction</h2><p>Amazon’s Alexa accounted for 62% of the worldwide market share in 2017 among all voice assistants (Statistica.com). It can hold a simple conversation, make voice or video calls, and allow for the internet to be more accessible to those with certain disabilities. <img src=\"https://posix23.github.io/privacy-issue-website/robinhood.png\" alt=\"Robinhood hacked\" width=\"15%\" height=\"15%\" style=\"float: left; margin: 3px 3px 3px 0\"> Despite these, Amazon and some of its recent products related to machine learning assistants have drawn concern from the public over potential opportunities for data collection and misuse. With around 100 million Alexa-based devices being sold in 2018 alone (Statistica.com), Amazon is dealing with a massive number of customers, all of whose trust is being placed in Amazon’s hands. Currently, Amazon has done well with no major privacy breaches or data leaks, but a few isolated incidents cause us to question the data collection practices of the tech giant.Our project focuses on the many ethical concerns behind Amazon and the technologies it has developed. The voice assistant Alexa and the robot companion Astro are both powered by Lex, a voice recognition tool that allows people to have the convenience of a web browser without having to pull out a phone or sit at a computer. However, the tech giant’s products such as the popular Amazon Echo have raised concerns over their ethicality and use of user data. Consumers interact with their Echo entirely by speech, so the device is always listening for when it needs to answer a question or perform a task. Amazon claims that their voice-recognition products are not recording users or even listening unless a certain “wake word” is spoken aloud, but evidence proves otherwise. Users have been sent audio clips recorded by other individuals who own an Amazon Echo, proving that these devices record and store user data for extended periods of time.</p><h2>Research</h2><p>The general consensus on Amazon’s data collection is split. The interned holds mixed feelings, with some alleging that Amazon has not made any major errors as there have not been any major breaches. Other opinions suggest that the small leaks which have happened are clear signs that there are major problems to come when it comes to Amazon and its data. Most of the complaints surrounding Amazon’s practices stem from a few incidents which have happened to customers. In an article from the website, “The Conversation”, called, Amazon Echo’s privacy issues go way beyond voice recordings, some of these negative aspects are brought to light. One of the primary concerns from this article is that the echo brings together the worst aspects of smartphones and smart homes, and is integrated into the home environment in a way in which it is always listening. A major concern of this particular problem is that there is potential for law enforcement to tap into these devices in order to gain knowledge on suspects or ordinary people. The article warns of a sort of police state, where people cannot feel safe in their own homes. The culture of surveillance is a major issue in modern-day society as technology continues to advance, and we will only see more technology to accomplish like this put in place. Another concern the article presents is that the National Health Service has signed a deal for medical advice to be provided to echo. This creates the possibility of tracking health information we ask for through Alexa, which builds user profiles of their medical history. This could become an issue because it provides Amazon with even more data to track and possibly sell or have it breached and sent to various locations that are not authorized by the consumer. This is one of the most important privacy issues, as normally medical professionals must abide by the Health Insurance Portability and Accountability Act (HIPPA). This prevents important patient information from being disclosed, but when this information is given to Alexa, this data may be collected by Amazon as they see fit. Another relatively unexplored concept is the new Amazon Astro, which is essentially an Echo with a screen that moves around the house. When a call is made, the other party sees through the Astro, leading to hackers gaining access to the camera of the Astro, much like the hacking of a laptop camera or a webcam. As these potential privacy breaches are brought up, the natural question is how Amazon has responded to these concerns. Unfortunately for many users’ peace of mind, Amazon has not directly addressed many of these concerns, failing to calm the thousands of concerned customers. Hopefully, Amazon will be far more transparent about its data practices in the upcoming future. Another article, Is Amazon Alexa Invading Privacy? Analysis of an Ethical Dilemma, tells a different story. This article takes on a more positive tone when it comes to the use of Alexa. The author explains that “Customers of smart home devices should not stress about these devices invading their privacy”. The article goes on to explain that Amazon has implemented certain settings that restrict which data gets saved. Amazon chooses to use its user data to benefit its stakeholders and users rather than selling the data for financial profit. Amazon wants to create a full “360” view of a customer which will benefit both the customer and Amazon. The article suggests that the company does not ever disclose information with others unless they are required to by the government for legal reasons. Despite with this article suggesting that Amazon is responsible when it comes to keeping their customer data private, any company that stores large amounts of data would come out with a similar quote as the one mentioned above. It is always essential to be wary especially when it comes to personal data. Both of these articles bring up valid points which lead to an interesting conversation of whether these services have more positives or negatives. The benefits of Amazon products are significant and have led the way in technology innovation. Alexa specifically can do so much to make an individual’s day more efficient. The most prominent feature which allows this is the ability to ask Alexa questions and receive an answer. In this way, Alexa is like having a more accessible phone which responds to voice commands. With the Echo and the newly released Amazon Astro, sending messages and voice calls hands-free along with many other features that improve overall efficiency while using their products. While rare due to how recently the product was released, the Astro can even follow a user around a house like a dog, and even be summoned which is huge for accessibility. The Echo can also act as a hub for a smart home, as lights, temperature, and other utilities or appliances can be easily controlled with voice input. Alexa is able to do all of these which creates the feeling of a true smart home. Part of what makes Alexa innovative is that Amazon is continuously updating and adding skills to Alexa which makes it more useful over time. These include accessibility for new languages, which is a nice touch to add considering so many different people use these products. Amazon has said publicly that there are over 100,000 unique Alexa skills globally and will only continue to grow. The unethical negatives of Alexa and its partners Echo and Lex remain significant however. The device itself is always listening, and there are examples of Alexa recording conversations without the permission of the user. Mentioned above are “unique skills” in order to improve the user experience of Alexa. However, before 2018, users had to accept terms to these skills which would allow the user to understand what type of data is being collected by the device. Now, they hardly have an understanding of where the answer Alexa gives them is coming from. Essentially this allows anyone to publish an Alexa skill and upload it for people to use. This makes it easy for an impersonator to attack while being under the guise of a well-known manufacturer. Rarely do any of these skills available to the user have a privacy policy to go along with it. Some Amazon Echo users reported that they could even hear conversations of strangers, presumably with Echo products, on their Echoes (<a href=\"https://www.popularmechanics.com/technology/gear/a20901667/amazon-alexa-device-caught-sending-private-conversations-to-stranger/\">Amazon Alexa Device Caught Sending Private Conversations to Stranger (popularmechanics.com)</a>). Although these are largely isolated incidents and relatively rare, we feel that the Alexa line of products are unethical at times, and require more work and transparency from Amazon to feel secure.</p><h2>Additional researches</h2><p>Millions of people across the world own a device with an Alexa assistant, so this is potentially a massive breach of customer privacy and a topic we feel needs to be addressed in great depth. While researching Alexa, we came across examples from other big tech giants that we believe to be important in the context of a potential data breach at Amazon. We can see what happened to Robinhood recently. Their data got so big that a lot of malicious individuals wanted to hack into their database to steal. The result is millions of people got their names and emails leaked (<a href=\"https://blog.robinhood.com/news/2021/11/8/data-security-incident\">Robinhood Announces Data Security Incident — Under the Hood</a>). This also saw the stock of Robinhood tank the day after on New York Stock Exchange. Further back, in 2017, Cloudfare, the popular online security firm whose products included the popular 1.1.1.1 DNS, got a massive memory leak that contained customers’ information such as their HTTPS cookies, authentication tokens, POST request body that could contain sensitive data. The leak was called Cloudbleed (<a href=\"https://blog.cloudflare.com/incident-report-on-memory-leak-caused-by-cloudflare-parser-bug/\">Incident report on memory leak caused by Cloudflare parser bug</a>). Leaks and data breaches from these large technology corporations show that they can happen to any big company out there. Especially with how much data Amazon collects along with their methods of recording conversations and other voice notes, Amazon is most certainly going to see a massive breach of their data at some point. The real question is, when is it going to happen?</p><h2>Works cited</h2><ul><li><a href=\"https://www.cnet.com/home/smart-home/amazon-bolsters-alexa-privacy-after-user-trust-takes-a-hit/\">Amazon bolsters Alexa privacy after user trust takes a hit</a></li><li><a href=\"https://voicebot.ai/2021/01/14/alexa-skill-counts-surpass-80k-in-us-spain-adds-the-most-skills-new-skill-introduction-rate-continues-to-fall-across-countries/\">Alexa Skill Counts Surpass 80K in US, Spain Adds the Most Skills, New Skill Rate Falls Globally</a></li><li><a href=\"https://www.cnbc.com/video/2021/11/09/robinhood-data-breach-shows-company-is-not-ready-cramer-says.html\">Robinhood data breach shows company is ‘not ready’, Cramer says</a></li></ul>",
  "tos": "<h2>Last updated: December 8th, 2021</h2><h2>Terms of Service</h2><p>PLEASE READ THESE TERMS CAREFULLY. These Terms of Service govern your use of this application. By agreeing to the terms, you are granted access to the website and are abided by all the terms listed in this Terms of Service. If you do NOT agree with any of these terms, simply exit the page by dialing away from it. We would recommend Youtube.</p><h2>Definition</h2><p>'We', 'Us', and 'Our' are the three entities who hold the copyright to this application. 'You' and 'Your' are the entity who is reading and accepting this Terms of Service.</p><h2>Binding agreement</h2><p>The content on this page is copyrighted by Group 10 of INFO 350 Autumn 2022 Class of the University of Washington and therefore, is copyrighted by the three entities Toan Ly, Luke Dorsett, and Ryan Mudgett. Any usage of any part of this application outside of the Internet and our domain is considered illegal and might result in violence. Internet is defined as if you have access to google.com. Violence here is defined by the act of punching and/or kicking from one entity to another. In this case, we will give you the violence and you have the right to give us the violence back if you deem it to be necessary. If you would like to quote part of our content, you may do so and link it back to our application. You must NOT transmitted any worms, viruses, or destructive codes of any kind to this application. This application is hosted by Github for the front end and Heroku on the back end. Therefore, by agreeing to these terms, you are also agreeing to their Terms of Service. Their Terms of Service can be found on their respective websites. The website was created with open sourced projects. React JS by Facebook for the front end developement and Express JS for back end REST API development. The source code for this website is opened but, we will not tell you where it is. If you have read this far, it is probably the case that you are stuck with the 15 minute timer that we have set on the website or maybe, you actually read everything up to this point of these Terms of Service (kudos to you for doing that). You can <span id=\"click-here\">click here</span> to close it. These words below are meant to hide the click here button away. The ingredients for cheesecake are block cream cheese, sugar, sour cream, pure vanilla, lemon juice, and eggs. Did you know that on a sunny day, the sun is out? Why are you still reading this? Disclaimer: WE ARE NOT LAWYERS and every part of this Terms of Service should not be taken seriously. We reserve the right to refuse your access to our website.</p><h2>Privacy Policies</h2><p>We do not collect cookies or use any form of tracking. If you feel like you are being tracked on our website, it is not us but, probably Github or Heroku. Blame them. We have nothing to do with it.</p><h2>Termination of usage</h2><p>We reserve the right to block your IP address from accessing our application if necessary. Even if you are using a VPN, we will hunt you down and block your corresponding VPN's IP addresses.</p>"
}
